# ██████╗  █████╗ ██╗  ██╗ █████╗ ██████╗ ██╗██████╗ 
# ██╔══██╗██╔══██╗██║  ██║██╔══██╗██╔══██╗██║██╔══██╗
# ██████╦╝███████║███████║██║  ██║██║  ██║██║██████╔╝
# ██╔══██╗██╔══██║██╔══██║██║  ██║██║  ██║██║██╔══██╗
# ██████╦╝██║  ██║██║  ██║╚█████╔╝██████╔╝██║██║  ██║
# ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝ ╚════╝ ╚═════╝ ╚═╝╚═╝  ╚═╝

# 🔒 Licensed under the GNU GPLv3
# 🌐 https://www.gnu.org/licenses/agpl-3.0.html
# 👤 https://t.me/baxa_akee_2602



n=1
eggs=int(input("Enter number of eggs: "))
surv_eggs = int(input(f"Enter number of survived chickens(note more than {eggs}): "))
flyaway = int(input("Enter number of chickens which fly away: "))
t = int(input('Enter year: '))

for i in range(0,t*2):
    annual = surv_eggs - flyaway
    annual1 = annual * n
    n += annual1

print(n)
